# create Pandas Series

In [1]:
import pandas as pd

In [4]:
a = pd.Series([56,78,8,10,34])

In [5]:
a

0    56
1    78
2     8
3    10
4    34
dtype: int64

In [4]:
type(a)

pandas.core.series.Series

In [5]:
a

0    56
1    78
2     8
3    10
4    34
dtype: int64

In [6]:
a[3]

10

In [7]:
a[2:4]

2     8
3    10
dtype: int64

In [8]:
a = pd.Series(['soc','python','Java'])

In [9]:
a

0       soc
1    python
2      Java
dtype: object

In [16]:
a = pd.date_range(start = '1-1-2019', end = '1-30-2019')

In [17]:
a

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30'],
              dtype='datetime64[ns]', freq='D')

In [18]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

# Pandas dataframe

In [19]:
import numpy as np

In [20]:
temp = np.random.randint(low = 20, high =100, size = [10,])
name = np.random.choice(['nabin','vamsi','parth','satish'],size=10)
random = np.random.choice([10,11,13,12,14],10)

In [21]:
random

array([14, 11, 13, 14, 13, 14, 11, 13, 14, 10])

In [22]:
name

array(['nabin', 'nabin', 'nabin', 'vamsi', 'vamsi', 'satish', 'satish',
       'parth', 'satish', 'parth'], dtype='<U6')

In [23]:
temp

array([29, 51, 49, 91, 68, 78, 25, 84, 97, 91])

In [24]:
a = list(zip(temp, name, random))

In [25]:
a

[(29, 'nabin', 14),
 (51, 'nabin', 11),
 (49, 'nabin', 13),
 (91, 'vamsi', 14),
 (68, 'vamsi', 13),
 (78, 'satish', 14),
 (25, 'satish', 11),
 (84, 'parth', 13),
 (97, 'satish', 14),
 (91, 'parth', 10)]

In [26]:
df = pd.DataFrame(data = a, columns=['temp','name','random'])

In [27]:
df

   temp    name  random
0    29   nabin      14
1    51   nabin      11
2    49   nabin      13
3    91   vamsi      14
4    68   vamsi      13
5    78  satish      14
6    25  satish      11
7    84   parth      13
8    97  satish      14
9    91   parth      10

In [17]:
type(df)

pandas.core.frame.DataFrame

In [28]:
import pandas as pd
import numpy as np

In [29]:
temp = np.random.randint(low = 20, high =100, size = [10,])
name = np.random.choice(['nabin','vamsi','parth','satish'],size=10)
random = np.random.choice([10,11,13,12,14],10)

In [30]:
df = pd.DataFrame({'temp':temp, 'name':name, 'random':random})

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df

   temp    name  random
0    78  satish      14
1    56  satish      14
2    29   nabin      11
3    68  satish      10
4    28   parth      13
5    31   vamsi      14
6    22   vamsi      10
7    57   vamsi      11
8    20  satish      11
9    74  satish      13

In [34]:
df.head(2)

   temp    name  random
0    78  satish      14
1    56  satish      14

In [36]:
df.tail(3)

   temp    name  random
7    57   vamsi      11
8    20  satish      11
9    74  satish      13

In [37]:
df.shape

(10, 3)

In [38]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

In [39]:
df.values

array([[78, 'satish', 14],
       [56, 'satish', 14],
       [29, 'nabin', 11],
       [68, 'satish', 10],
       [28, 'parth', 13],
       [31, 'vamsi', 14],
       [22, 'vamsi', 10],
       [57, 'vamsi', 11],
       [20, 'satish', 11],
       [74, 'satish', 13]], dtype=object)

In [30]:
# normal indexing is not support 
# it can support only slicing and dicing 
df[2:7]

   temp   name  random
2    84  parth      13
3    66  parth      14
4    35  parth      10
5    25  parth      11
6    83  vamsi      13

In [31]:
df[2:9:3]

   temp    name  random
2    84   parth      13
5    25   parth      11
8    47  satish      14

In [32]:
# access whole column data
df['random']

0    12
1    12
2    13
3    14
4    10
5    11
6    13
7    13
8    14
9    12
Name: random, dtype: int32

In [40]:
df.name

0    satish
1    satish
2     nabin
3    satish
4     parth
5     vamsi
6     vamsi
7     vamsi
8    satish
9    satish
Name: name, dtype: object

In [41]:
df['name']

0    satish
1    satish
2     nabin
3    satish
4     parth
5     vamsi
6     vamsi
7     vamsi
8    satish
9    satish
Name: name, dtype: object

In [42]:
df.describe()

            temp    random
count  10.000000  10.00000
mean   46.300000  12.10000
std    22.612926   1.66333
min    20.000000  10.00000
25%    28.250000  11.00000
50%    43.500000  12.00000
75%    65.250000  13.75000
max    78.000000  14.00000

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
temp      10 non-null int32
name      10 non-null object
random    10 non-null int32
dtypes: int32(2), object(1)
memory usage: 240.0+ bytes

In [44]:
df

   temp    name  random
0    78  satish      14
1    56  satish      14
2    29   nabin      11
3    68  satish      10
4    28   parth      13
5    31   vamsi      14
6    22   vamsi      10
7    57   vamsi      11
8    20  satish      11
9    74  satish      13

In [45]:
df.set_index('name', inplace = False)

        temp  random
name
satish    78      14
satish    56      14
nabin     29      11
satish    68      10
parth     28      13
vamsi     31      14
vamsi     22      10
vamsi     57      11
satish    20      11
satish    74      13

In [46]:
df

   temp    name  random
0    78  satish      14
1    56  satish      14
2    29   nabin      11
3    68  satish      10
4    28   parth      13
5    31   vamsi      14
6    22   vamsi      10
7    57   vamsi      11
8    20  satish      11
9    74  satish      13

In [47]:
df.set_index('name',inplace=True)

In [48]:
df

        temp  random
name
satish    78      14
satish    56      14
nabin     29      11
satish    68      10
parth     28      13
vamsi     31      14
vamsi     22      10
vamsi     57      11
satish    20      11
satish    74      13

In [49]:
df.sort_index(axis =0, ascending=True)

        temp  random
name
nabin     29      11
parth     28      13
satish    78      14
satish    56      14
satish    68      10
satish    20      11
satish    74      13
vamsi     31      14
vamsi     22      10
vamsi     57      11

In [50]:
df

        temp  random
name
satish    78      14
satish    56      14
nabin     29      11
satish    68      10
parth     28      13
vamsi     31      14
vamsi     22      10
vamsi     57      11
satish    20      11
satish    74      13

In [53]:
df.sort_values(by ='random', ascending = True,inplace =True)

In [55]:
df

        temp  random
name
satish    68      10
vamsi     22      10
nabin     29      11
vamsi     57      11
satish    20      11
parth     28      13
satish    74      13
satish    78      14
satish    56      14
vamsi     31      14

In [56]:
df.drop(['random'], axis =1)

        temp
name
satish    68
vamsi     22
nabin     29
vamsi     57
satish    20
parth     28
satish    74
satish    78
satish    56
vamsi     31

In [57]:
df

        temp  random
name
satish    68      10
vamsi     22      10
nabin     29      11
vamsi     57      11
satish    20      11
parth     28      13
satish    74      13
satish    78      14
satish    56      14
vamsi     31      14

In [59]:
df.iloc[[1,2]]

       temp  random
name
vamsi    22      10
nabin    29      11

In [60]:
df.iloc[:,1]

name
satish    10
vamsi     10
nabin     11
vamsi     11
satish    11
parth     13
satish    13
satish    14
satish    14
vamsi     14
Name: random, dtype: int32

In [61]:
df.iloc[[True,True,False,True]]

        temp  random
name
satish    68      10
vamsi     22      10
vamsi     57      11

In [69]:
df.loc[[True,True,True,True]]

        temp
random
10        68
10        22
11        29
11        57

In [62]:
df.set_index('random',inplace=True)

In [63]:
df

        temp
random
10        68
10        22
11        29
11        57
11        20
13        28
13        74
14        78
14        56
14        31

In [64]:
df.loc[14]

        temp
random
14        78
14        56
14        31

In [65]:
df.loc[14,'temp']

random
14    78
14    56
14    31
Name: temp, dtype: int32

In [66]:
df.loc[[11,12,13]]

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

        temp
random
11      29.0
11      57.0
11      20.0
12       NaN
13      28.0
13      74.0

In [67]:
df.loc[12:'temp']

        temp
random
13        28
13        74
14        78
14        56
14        31

In [70]:
df.loc[df.temp > 50]

        temp
random
10        68
11        57
13        74
14        78
14        56

In [71]:
df.loc[(df.temp <80) | (df.temp == 91),:]

        temp
random
10        68
10        22
11        29
11        57
11        20
13        28
13        74
14        78
14        56
14        31

In [72]:
import pandas as pd
import warnings 
warnings.filterwarnings('ignore')

In [73]:
# Merging & concat
d1 = pd.DataFrame([['a', 1], ['b', 2]],columns=['col1', 'number'])
d2 = pd.DataFrame([['c', 3, 'lion'], ['d', 4, 'tiger']],columns=['letter', 'number', 'animal'])

In [74]:
d1

  col1  number
0    a       1
1    b       2

In [75]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [76]:
pd.concat([d1,d2],axis =0)

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4

In [77]:
pd.concat([d1,d2], axis =0, ignore_index=True)

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
2   lion  NaN      c       3
3  tiger  NaN      d       4

In [78]:
pd.concat([d1,d2], axis = 1)

  col1  number letter  number animal
0    a       1      c       3   lion
1    b       2      d       4  tiger

In [79]:
d1 = pd.DataFrame({
    "city" : ["lucknow","kanpur","agra","delhi"],
    "temperature" : [32,45,30,40]
})

In [80]:
d1

      city  temperature
0  lucknow           32
1   kanpur           45
2     agra           30
3    delhi           40

In [81]:
d2 = pd.DataFrame({
    "city" : ["delhi","lucknow","kanpur"],
    "humidity" : [68,65,75]
})

In [87]:
d2

      city  humidity
0    delhi        68
1  lucknow        65
2   kanpur        75

In [88]:
d1

      city  temperature
0  lucknow           32
1   kanpur           45
2     agra           30
3    delhi           40

In [82]:
df = pd.merge(d1,d2, on='city')

In [83]:
df

      city  temperature  humidity
0  lucknow           32        65
1   kanpur           45        75
2    delhi           40        68

In [84]:
pd.merge(d1,d2, on=['city'], how ='outer')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [67]:
pd.merge(d1, d2, on =['city'], how='left')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [73]:
# dataset from https://github.com/codebasics/py/blob/master/pandas/6_handling_missing_data_replace/weather_data.csv

In [85]:
df1 = pd.read_csv("weather_data.csv")

In [86]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [87]:
# pip3 install openpyxl
df1.to_excel('df_xl.xlsx', sheet_name = 'weather_data')

In [88]:
# pip3 install xlrd
df2 = pd.read_excel('df_xl.xlsx')

In [89]:
df2

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [90]:
df2.to_csv('file.csv')

In [91]:
df2.to_csv('file_noindex.csv', index = False)

In [92]:
df_group = df2.groupby("event")

In [93]:
df_group

In [94]:
for temperature in df_group:
    print(temperature)

('Rain',    Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain)
('Snow',    Unnamed: 0       day  temperature  windspeed event
2           2  1/3/2017           28          2  Snow
3           3  1/4/2017           24          7  Snow)
('Sunny',    Unnamed: 0       day  temperature  windspeed  event
1           1  1/2/2017           35          7  Sunny
5           5  1/6/2017           31          2  Sunny)

In [95]:
df_group.get_group('Rain')

   Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain

In [96]:
df_group.describe()

      Unnamed: 0                                           temperature        \
           count mean       std  min   25%  50%   75%  max       count  mean
event
Rain         2.0  2.0  2.828427  0.0  1.00  2.0  3.00  4.0         2.0  32.0
Snow         2.0  2.5  0.707107  2.0  2.25  2.5  2.75  3.0         2.0  26.0
Sunny        2.0  3.0  2.828427  1.0  2.00  3.0  4.00  5.0         2.0  33.0

       ...             windspeed
       ...   75%   max     count mean       std  min   25%  50%   75%  max
event  ...
Rain   ...  32.0  32.0       2.0  5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   ...  27.0  28.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  ...  34.0  35.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

[3 rows x 24 columns]

In [80]:
def hot_temp(x):
    return x > 30

In [81]:
df2['hot_temp'] = df2['temperature'].apply(hot_temp)

In [82]:
df2

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [108]:
df2['hot_temp'] = df2['temperature'].apply(lambda x: x > 30)

In [109]:
df2

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [92]:
#pivot table

In [110]:
df2.pivot_table(values = 'temperature', index = 'event', aggfunc = 'mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [97]:
df2.pivot_table(columns = 'temperature')

temperature  24  28  31  32  35
Unnamed: 0    3   2   5   2   1
windspeed     7   2   2   5   7

In [96]:
help(pd.DataFrame.pivot_table)

Help on function pivot_table in module pandas.core.frame:

pivot_table(self, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All')
    Create a spreadsheet-style pivot table as a DataFrame. The levels in
    the pivot table will be stored in MultiIndex objects (hierarchical
    indexes) on the index and columns of the result DataFrame

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function or list of functions, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
    fill_value : scalar, default None
        Value to replace missing values with
    margins : boolean, default False
        Add all row / columns (e.g. for subtotal / grand totals)
    dropna : boolean, default True
        Do not include columns whose entries are all NaN
    margins_name : string, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
    >>> df
         A    B      C  D
    0  foo  one  small  1
    1  foo  one  large  2
    2  foo  one  large  2
    3  foo  two  small  3
    4  foo  two  small  3
    5  bar  one  large  4
    6  bar  one  small  5
    7  bar  two  small  6
    8  bar  two  large  7

    >>> table = pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    ... # doctest: +NORMALIZE_WHITESPACE
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    Returns
    -------
    table : DataFrame

    See also
    --------
    DataFrame.pivot : pivot without aggregation that can handle
        non-numeric data